blog/java-enviroment-variable-setting.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Java 环境变量设置</title>
<!-- 2019-04-15 Mon 15:20 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Siqing Mu" />
<link rel="shortcut icon" href="https://www.khow.me/blog/images/favicon.ico" /><link rel="stylesheet" type="text/css" href="./css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">Java 环境变量设置</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 设置环境变量</a></li>
<li><a href="#sec-2">2. 关于classpath中jar包的含义</a></li>
<li><a href="#sec-3">3. source link</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 设置环境变量</h2>
<div class="outline-text-2" id="text-1">
<p>
在home当前目录下用编辑器打开.zshrc文件并将下面内容添加到其内。
</p>
<pre class="example">
##JAVA ENVIROMENT                                                                                                     
export JAVA_HOME=/Library/Java/JavaVirtualMachines/jdk1.8.0_152.jdk/Contents/Home
export PATH=$JAVA_HOME/bin:$PATH
export CLASSPATH=.:$JAVA_HOME/lib/dt.jar:$JAVA_HOME/lib/tools.jar
</pre>
<p>
添加完毕后记得执行source .zshrc使其生效。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 关于classpath中jar包的含义</h2>
<div class="outline-text-2" id="text-2">
<p>
dt.jar和tools.jar位于：{Java_Home}/lib/下，而rt.jar位于：{Java_Home}/jre/lib/下,其中：
</p>

<p>
rt.jar是JAVA基础类库，也就是你在java doc里面看到的所有的类的class文件
dt.jar是关于运行环境的类库
</p>

<p>
tools.jar是工具类库,编译和运行需要的都是toos.jar里面的类分别是sun.tools.java.*; sun.tols.javac.*;
</p>


<p>
在Classpath设置这几个变量，是为了方便在程序中 import；Web系统都用到tool.jar。
</p>
<ol class="org-ol">
<li>rt.jar
rt.jar 默认就在Root Classloader的加载路径里面的，而在Claspath配置该变量是不需要的；同时jre/lib目录下的

<p>
其他jar:jce.jar、jsse.jar、charsets.jar、resources.jar都在Root Classloader中
</p>
</li>

<li>tools.jar

<p>
tools.jar 是系统用来编译一个类的时候用到的，即执行javac的时候用到
</p>

<p>
javac XXX.java
</p>

<p>
实际上就是运行
</p>

<p>
java -Calsspath=%JAVA_HOME%\lib\tools.jar xx.xxx.Main XXX.java
</p>

<p>
javac就是对上面命令的封装 所以tools.jar 也不用加到classpath里面
</p>
</li>

<li>dt.jar
dt.jar是关于运行环境的类库,主要是swing的包   在用到swing时最好加上。
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> source link</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="https://www.cnblogs.com/jtlgb/p/6039809.html">JDK中rt.jar、tools.jar和dt.jar作用</a>
</li>
<li><a href="https://www.cnblogs.com/havenshen/p/3490448.html">mac OS X 10.9.1 配置jdk环境变量</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
            <script type="text/javascript">
            var disqus_shortname = 'seymer';
            (function() {
                    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
            </script>
            <script>
              (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
                      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
                      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

              ga('create', 'UA-110114842-1', 'auto');
              ga('send', 'pageview');
            </script>
</div>
</body>
</html>